import numpy as np

# 终值计算
# 终值 = numpy.fv(利率, 期数, 每期支付, 现值)
# 将1000元以1%的年利率存入银行5年，每年加存100元，到期后的本息合计多少钱。
fv = np.fv(0.01, 5, -100, -1000)             # 正负相对于自己，拿出为负，拿进为正
print(round(fv,2))

# 现值 = numpy.pv(利率, 期数, 每期支付, 终值)
# 将多少钱以1%的年利率存入银行5年，每年加存100元，到期后的本息合计 fv 元？
pv = np.pv(0.01, 5, -100, fv)
print(pv)

# 净现值=numpy.npv(利率, 现金流)
# 将1000元存入银行，每年加存100元。相当于1次存入多少钱。
npv = np.npv(0.01, [-1000,-100,-100,-100,-100,-100])
print(npv)

# 内部收益率 = numpy.irr(现金流)，使净现值为0的收益率
# 将1000元存入银行5年，以后逐年提现100元、200元、300元、400元、500元，银行年利率达到多少，可以在最后一次提现后偿清全部本息。即净现值为0元。
irr = np.irr([-1000,100,200,300,400,500])
print(round(irr,2))

# 每期支付 = numpy.pmt(利率, 期数, 现值)
# 以1%的年利率从银行贷款1000元，分5年还清，平均每年还多少钱。
pmt = np.pmt(0.01, 5, 1000)
print(round(pmt,2))

# 期数 = numpy.nper(利率，每期支付, 现值)
# 以1%的年利率从银行贷款1000元，平均每年还pmt元，多少年还清。
nper = np.nper(0.01, pmt, 1000)
print(nper)

# 利率 = np.rate(期数, 每期支付, 现值, 终值)
# 从银行贷款1000元，分nper年还清，每年还pmt元，年利率多少？
rate = np.rate(nper, pmt, 1000, 0)
print(rate)